function F = myfun(x)
% 这是一个用于fsolve的函数，它接受一个向量x并返回一个向量F
% 这里的方程是 x^2 + y^2 = 1 和 x - y = 0
c = x(1)*(10^(-12));
l = x(2)*(10^(-9));
a1 = x(3)*0.001;
z0 = 377;
z1 = x(4)*377;
F(1) = -(z0^2)*z1*(cos(a1)^2) - (z1^3)*(sin(a1))^2+ -3.9688*10^31; % 第一个方程
F(2) = -2*l*(z1^2)*cos(a1)*sin(a1) - (z0*(l + c*(z1^2))*sin(2*a1))/(2*l*z1) - 1.57914*10^20; % 第二个方程
F(3) = 2*c*l*(z0^2)*z1*(cos(a1)^2) - 2*c*l*(z0^2)*z1*(sin(a1)^2) - (c^2)*(z0^2)*(z1^3)*(sin(a1)^2)-3.26726*10^10;
F(4) = -2*(c^2)*l*(z0^2)*(z1^2)*cos(a1)*sin(a1)+0.4;
end
